Autodesk.Revit.DB.Structure.TargetRebarConstraintType.OutOfPlaneExtent
Handle is constrained to the extent of a three-dimensional Rebar out of
its primary plane. This includes the length of a Rebar Set, the
out-of-plane length of a multi-planar Rebar, and the length of a
spiral Rebar.